Repository: vakaras/nmadb-session-reg
Catalog: src/nmadb_session_reg/locale/*/LC_MESSAGES/django.po
Languages: lt

source: {0} base infos about students successfully imported.
lt: {0} dalyvių bazinių informacijų buvo sėkmingai importuota.

source: NMADB Session Registration
lt: NMADB sesijos registracijos

source: Updated ({0.id} {0.first_name} {0.last_name}) {1}: „{2}“ → „{3}“
lt: Atnaujinta ({0.id} {0.first_name} {0.last_name}) {1}: „{2}“ → „{3}“

source: Error: {0.first_name} {0.last_name}
lt: Klaida: {0.first_name} {0.last_name}

source: No address: {0.first_name} {0.last_name}
lt: Nėra adreso: {0.first_name} {0.last_name}

source: {0.id} {0.first_name} {0.last_name} (birth date: {0.birth_date}) already exists in database, but creating a new one as {1.id} {1.first_name} {1.last_name} parent.
lt: {0.id} {0.first_name} {0.last_name} (gimimo data: {0.birth_date}) jau yra duomenų bazėje, bet pridedamas dar vienas įrašas kaip {1.id} {1.first_name} {1.last_name} tėvas.

source: Ignored: {0.first_name} {0.last_name}
lt: Praleista: {0.first_name} {0.last_name}

source: Created group: {0.id} {0.session} {0.comment}
lt: Sukurta grupė: {0.id} {0.session} {0.comment}

source: Created participation ({0.id} {0.first_name} {0.last_name}) {1} and added to {2.id} {2.comment}
lt: Sukurtas dalyvavimo įrašas ({0.id} {0.first_name} {0.last_name}) {1} ir pridėtas į {2.id} {2.comment}

source: Selected {0} entries.
lt: Pasirinkti {0} įrašai.

source: Update NMADB info with collected data.
lt: Atnaujinti NMADB informaciją su surinkta medžiaga.

source: Create participation entries.
lt: Sukurti dalyvavimo įrašus.

source: send email
lt: siųsti laišką

source: send template mail synchronously
lt: siųsti šabloninį laišką sinchroniškai

source: send template mail asynchronously
lt: siųsti šabloninį laišką asinchroniškai

source: Unknown
lt: Nežinoma

source: download registration sheet as pdf
lt: atsisiųsti registracijos sąrašus pdf formatu

source: download lecturer sheet as pdf
lt: atsisiųsti sąrašus dėstytojui pdf formatu

source: Import student base info
lt: Importuoti mokinių bazinę informaciją

source: Import sections and groups
lt: Importuoti sekcijas ir grupes

source: If there is only one of the parents, then please fill information only about him and in other form choose “none”
lt: Jei yra tik vienas iš tėvų, užpildykite informaciją tik apie jį, o kitoje formoje pasirinkite „nėra“.

source: Fix errors in the student form.
lt: Ištaisykite klaidas mokinio formoje.

source: Fix errors in the address form.
lt: Ištaisykite klaidas adreso formoje.

source: Fix errors in parent forms.
lt: Ištaisykite klaidas tėvų formose.

source: Please give at least one parent phone number.
lt: Įveskite bent vieno iš tėvų telefono numerį.

source: Please give at least one parent email address.
lt: Įveskite bent vieno iš tėvų elektroninio pašto adresą.

source: Fix errors in rating forms.
lt: Ištaisykite klaidas įvertinimo formose.

source: Assign different values to different programs.
lt: Priskirkite skirtingas reikšmes skirtingoms programoms.

source: First name
lt: Vardas

source: Last name
lt: Pavardė

source: Email
lt: El. pašto adresas

source: Section title
lt: Sekcijos pavadinimas

source: Payment
lt: Mokestis

source: Payment cannot be negative!
lt: Mokestis negali būti neigiamas!

source: Unknown section “{0}”.
lt: Nežinoma sekcija „{0}“.

source: Base info
lt: Bazinė informacija

source: Spreadsheet document
lt: Skaičiuoklės dokumentas

source: Please select spreadsheet file. Required columns are: {0}.
lt: Pasirinkite skaičiuoklės dokumento failą. Būtini stulpeliai yra: {0}.

source: first name
lt: vardas

source: last name
lt: pavardė

source: email address
lt: el. pašto adresas

source: section
lt: sekcija

source: comment
lt: komentaras

source: participant's payment
lt: dalyvio mokestis

source: commit timestamp
lt: įrašymo laikas

source: base info
lt: bazinė informacija

source: base infos
lt: bazinės informacijos

source: invitation identifier
lt: kvietimo identifikatorius

source: sent
lt: išsiųsta

source: invitation
lt: kvietimas

source: invitations
lt: kvietimai

source: personal phone number
lt: asmeninis telefono numeris

source: class
lt: klasė

source: class update year
lt: klasės atnaujinimo metai

source: This field value shows, at which year January 3 day student was in school_class.
lt: Ši reikšmė nurodo kurių metu sausio 3 dieną mokinys buvo klasėje school_class.

source: school
lt: mokykla

source: home address
lt: namų adresas

source: Null only if base_info.generated_address is present.
lt: Null tik tuo atveju, jei base_info.generated_address yra nurodytas.

source: student info
lt: mokinio informacija

source: student infos
lt: mokinių informacijos

source: payed
lt: sumokėta

source: True, if pupil have payed registration fee.
lt: Taip, jei mokinys sumokėjo registracijos mokestį.

source: chosen
lt: priimtas

source: Student was chosen.
lt: Mokinys buvo priimtas.

source: mother
lt: mama

source: father
lt: tėtis

source: tutoress
lt: globėja

source: tutor
lt: globėjas

source: none
lt: nėra

source: child
lt: vaikas

source: relation
lt: ryšys

source: parent info
lt: tėvo informacija

source: parent infos
lt: tėvų informacijos

source: winter
lt: žiema

source: spring
lt: pavasaris

source: summer
lt: vasara

source: autumn
lt: ruduo

source: year
lt: metai

source: session
lt: sesija

source: manager name dative
lt: vadovo vardas naudininko linksnyje

source: manager email
lt: vadovo el. pašto adresas

source: manager phone
lt: vadovo telefono numeris

source: administrator email
lt: administratoriaus el. pašto adresas

source: confirmation deadline
lt: patvirtinimo terminas

source: root page redirect address
lt: kokiu adresu nukreipti iš pagrindinio puslapio

source: title
lt: pavadinimas

source: description
lt: aprašymas

source: ratings of the session programs
lt: sesijų programų įvertinimai

source: session program
lt: sesijos programa

source: session programs
lt: sesijos programos

source: assigned session program
lt: priskirta sesijos programa

source: student
lt: mokinys

source: program
lt: programa

source: rating
lt: įvertinimas

source: The bigger the number, the more you want to participate in that program.
lt: Didesnis skaičius reiškia didesnį norą dalyvauti programoje.

source: Motivation
lt: Motivacija
